{"posts":[{"title":"关于开始图论课程的初步想法","text":"初次尝试前段时间复习闲得无聊，录了一个Gale-Shapley算法的视频上传到B站，本以为能骗点播放量，结果还没有之前随手录的吃罐头视频高😂 反思了一下，一方面可能是粉丝太少，很难精准推流；再一个就是像这样的视频没有系统性，也不够有个人特色，B站虽说是长视频平台但毕竟不是严肃的知识分享平台，专注于数学证明细节的视频播放量必然不会高。 但我确实很想录一些关于图论的视频。一是我确实觉得这些东西很有意思，很多定理的证明也很适合讲解（也就是比较优雅或者巧妙）。二是我觉得这也是一个很好的复习，完善自己知识体系的方法。所以视频还是要录的，但是要换个思路。 后续思考明确能力： 我目前知识体系并不完善，不可能进行课程式的全面讲解；平台上也已经有很多类似的系列课程，不管是在课程设计，内容深度，习题配套上都要比我单枪匹马制作的效果好很多 其他大部分现存课程主要以计算机或者competitive programming的视角切入，所以如果纯讲算法我也不可能会有优势，原因类上 虽然是录制课程，但我的主要目的还是分享和巩固，不可能为了播放量去做太多妥协。所以内容一定是基于我的上课内容和课本的。可以结合课内知识做一定拓展 除这些以外，我的优势在于视频结构灵活，可以就一个定理的证明拓展出去，或者分享一些我对某些定理的看法，证明的技巧 综上，我应该录制简短，但是浓缩重要的，有意思的定理的证明；虽然不用完全系统，但是可以由浅入深的用定理的证明把材料串联起来，或者作为preliminary，引理导出。 一些想法 介绍图的基本概念。给出eulerian circuit；给出bipartite graph以及odd cycle的等价刻画；定义有向图，给出相同结论；给出de brujin graph；给出国王定理，和一个有意思的证明（hw3）","link":"/2025/04/20/%E5%85%B3%E4%BA%8E%E5%BC%80%E5%A7%8B%E5%9B%BE%E8%AE%BA%E8%AF%BE%E7%A8%8B%E7%9A%84%E5%88%9D%E6%AD%A5%E6%83%B3%E6%B3%95/"},{"title":"一些近况 (迁移博客到新机器的测试帖)","text":"21:37 | 04/10/2025今天终于解决了头大很长时间的github本地仓库冲突问题，稍微总结一下。 问题的直接原因是本地和remote的差距太大了，一开始每次commit完之后没有push，导致一次性push太多报错。而之所以之前commit之后不push的原因，要么是在不同机器上写了之后出现了版本冲突，要么是之前很自作聪明的操作–把24sp的仓库里还没发布的作业直接拷贝到了这学期的仓库，结果就是这学期每次发布新作业的时候都会有大量merge conflict，然后全部要手动解决之后再merge push，然后一开始根本没搞懂情况瞎搞就把所有版本都弄乱了。这两个原因导致本地和release的remote仓库岔开很多。 解决方案 一开始尝试手动退回前面安全的版本，然后少量多次push，失败。 总结原因是每次push都有大量编译之后的binary文件,大小都是几十万行，很有可能git没法处理这种太复杂的冲突（其实具体什么问题我也没完全弄懂，但总之就是没法push） 最后的办法还是重新clone之后手动改。先pull remote，然后解决冲突 其实为什么重新clone之后还有冲突就很说明问题了，我推测其实我的远程仓库里面也已经版本乱七八糟了，导致clone过来之后和release里面还有很多冲突。 解决之后本来还想再把没有push到remote的改动重新改了之后再push一次，后来想想算了太麻烦了，反正作业都已经交了（ 总结 经验就是git没有想象的那么强大智能，版本控制还是要靠自己，冲突太多之后提供的解决办法虽然很多，但大部分其实也就是类似于二选一留一个这样的判断逻辑，冲突太多之后还是得手动一个一个看过去，几乎不可能不出错。所以最好的习惯还是每次出现问题直接解决到底，不然到后面只会问题越来越多。 现在的情况是lab_huffman和mp_traversal part2的代码丢掉了，其他暂时还没问题。 10:20 | 04/12/2025 今日周六，下周实分析期中考，需要复习一遍作业，把几个定理怎么用在证明里想清楚； 数据结构lab和mp要做，今天晚上要开始看，做完先交一版 暑研要发邮件，周日晚上之前要写好。现在还需要确定给哪几个phd发邮件，看好他们的研究方向。这个可以明天开始干，或者今天晚上 下周考试：实分析，周二考233，周四考357。357可以下周开始看，233需要提前把pre做掉，下周才有时间看考试 还有时间的话复习下图论 抽代。图论需要补一下前一章的证明 02:29 | 04/13/2025 这周接下来有很多要干：考试：周四357下周一图论quiz，周三考试。落下的有点多，这是周末的重点下周二233第二次，也需要看，但可以拖到周一 17:18 | 04/17/2025 今日复习一整天，cs357还是只考了78分。本以为这次很有把握，最后还是来不及写完编程，前面的填空也大意错了，不太满意。我目前对这节课失去希望了，唯一的盼头就是听说给分很好，但愿。我对数值方法这些东西真是完全提不起兴趣。 明天上完课后暂时没有due，但周末任务很重，大概率没时间休息。需要保证下周图论考试不出差错。 转眼又是周五。 生活 重复 睁眼 发呆","link":"/2025/04/18/%E4%B8%80%E4%BA%9B%E8%BF%91%E5%86%B5/"},{"title":"Hello Blog!","text":"some random thoughts One interesting fact is that this blog file was actually created five months ago, but I didn’t write a single sentence on it until today, which perfectly illustrate my most characteristic personality: lazy and changable. The original goal for this blog was to record the process of my taking the Linear algebra course, MAT2042 at CUHKSZ, including important contents of the lecture and my understanding of some difficult concepts. The course was quite nerve-racking for me at that time, as it stresses on formal proofs and somewhat magic algebraic transformations a lot, so I figured it’ll be nice if I can find somewhere to jot down something from time to time. But let’s be honest, all my free time ended up going into gaming and sleeping. So much for that plan. What I didn’t realize back then is that writing—especially writing about math—takes a lot more effort than I anticipated.Putting thoughts into words and making them logically clear isn’t easy. Rigorous Math endures no inaccuracy on language use. A tiny difference on word choice could lead to two totally different world, which is quite a challenge for me: I am never a serious guy. I never really care what words and sentences I chose to express certain meanings, sometimes I don’t even remember what I said five minutes ago. This is fatal to writing, especially academic writing, which explains why I didn’t feel like getting my hands on these blogs: I literally don’t know what to write about. But anyway, here I am now. I don’t expect what I write down here to be groundbreaking, but at least I’ll try to make them interesting. After all, whether I stick with it or not, I’ve written more than zero words today, and that’s called progress.","link":"/2024/04/10/%E7%AC%AC%E4%B8%80%E7%AF%87%E5%8D%9A%E5%AE%A2/"},{"title":"Halloweekend小记","text":"见闻这周末是所谓halloweekend，即万圣节前的那个周末。我在从健身馆回来的路上稍稍旁观了一下老美的万圣节。 走在路上​最直观的感受是一个个party上强烈的灯光和rap音乐，然后就是灯光和音乐下闹腾舞动着的人群，男生，女生，和不男不女者。 这些人成团体行动，他们的服装大同小异，男生无外乎炫酷游戏角色搞怪动物食物，女生无外乎可爱兔女郎猫女郎性感脱衣舞女郎，穿着单薄的衣服在香槟7度的寒风里兴奋地尖叫着抱作一团从一个party涌向下一个party。他们经过的地方留下白色的水汽，未等消散又被下一波相似的人群延续起来。 ​穿过几个街区后，你会有种，面前的这群人刚刚才碰到过的错觉：相似的服装，相似的笑声，相似的酒精味烟味浓烈香水味，甚至飘进耳中的只言片语都是同样的词汇。 离开中心区了，看着聚集在姐妹会兄弟会门口逐渐模糊的扭动着的人群，你感受到他们在展示着某种相似的力量，宣泄着某种相似的情绪。你说不清那是什么东西，但你知道你和那种东西隔的很远，你不属于它。 思考但“这种感觉”究竟是什么呢？和朋友讨论后，我认为这是一种“落差感”。 在我心中，社交活动（如聚会）和学习之间存在着矛盾——想要积极参与社交，就需要牺牲一定的学习时间。而对我来说，学习的重要性远远高于其他一切：我的学术能力直接代表了我的个人能力、个人价值以及社会地位。 这种逻辑在国内似乎完全合理，甚至可以说是普遍现象——所谓“万般皆下品，唯有读书高”，科举思维从未在社会中消失。这一点在学校里尤其明显。“学习好”和“学习差”这两类人之间的关系是上下的，而非平等的。即便你在其他方面再出色，学习成绩不如人依然会成为你身上抹不去的标签。无论你有多少优点，首先被人贴上的标签可能是“此人学习不佳”。因此，你失去了与他人平等竞争的机会，只有提升学习成绩，才能真正站到与他人相同的起跑线上。 坦白说，在国内我一直享受着学习成绩优异带来的优越感：这种优越感像是一种天然的特权。即便我在其他方面并不突出，但只要学习好，其他一切都显得无关紧要。只要学习好，我似乎就可以“结构性”地比别人高一等。至于社交？不过是学习成绩不佳的人消磨时间的一种方式罢了。 然而，在国外，情况不同了。学习不再具有特殊的地位，而是与其他兴趣“平行”的一种“爱好”。成绩再好，也不过是个nerd。这种优越感的消失，正是我所体验到的落差感。 这两种模式的优劣我不想多谈，国情不同，教育背景不同，没有可比性。让我感到有趣的是在这种比较中看见的东西：社会价值的宏观引导在影响着每一个个体，这种影响在个人来说是不自知的。只有当不同社会背景的个体发生碰撞时，我们才意识到这种引导多么深远地塑造了我们，而我们又是怎样地在这种塑造下不断反过来巩固着它本身。","link":"/2024/10/26/halloweekend%E8%A7%82%E5%AF%9F/"}],"tags":[{"name":"图论课程","slug":"图论课程","link":"/tags/%E5%9B%BE%E8%AE%BA%E8%AF%BE%E7%A8%8B/"},{"name":"B站","slug":"B站","link":"/tags/B%E7%AB%99/"},{"name":"log","slug":"log","link":"/tags/log/"},{"name":"introduction","slug":"introduction","link":"/tags/introduction/"},{"name":"First blog","slug":"First-blog","link":"/tags/First-blog/"},{"name":"随笔&#x2F;essay","slug":"随笔-essay","link":"/tags/%E9%9A%8F%E7%AC%94-essay/"}],"categories":[{"name":"academic","slug":"academic","link":"/categories/academic/"},{"name":"Personal","slug":"Personal","link":"/categories/Personal/"},{"name":"graph theory","slug":"academic/graph-theory","link":"/categories/academic/graph-theory/"}],"pages":[]}